let messageArray = 
[
    ` " إنَّ مَعَ العُسْرِ يُسْراً " `,
    ` " وَتَوَلَّنِي فِيمَنْ تَوَلَّيْتَ " `,
    ` " فَاصْبِرْ  " `,
    ` " إِنَّ رَبِّي قَرِيبٌ مُجِيبٌ " `,
    ` " قُلْ عَسَى أَنْ يَكُونَ قَرِيبًا " `,
    ` ما ألهمك الله الدعاء إلا ليستجيب لك `,
    ` " وَمَا كَانَ اللهُ لِيُعْجِزَهُ مِن شَيْء " `,
    ` " وَأُفَوِّضُ أَمْرِي إِلَى اللهِ " `,
    ` سيأتي بها الله وإن تأخرت `,
    ` الحمد لله على حياة يدبرها الله برحمته `,
    ` " وَعَلَى رَبِّهِمْ يَتَوَكَّلُونَ " `,
    ` لن يُحمِّلكَ الله شيئاً لا تقوى عليه لذلك أنت دوماً تستطيع `,
    ` " وَأَن لَّيْسَ لِلإِنسَانِ إِلاَّ مَا سَعَى " `,
    ` سيبشرك الله `,
    ` " وَمَا كَانَ رَبُّكَ نَسِيًّا  " `,
    ` " وَتَوَكَّلْ عَلَى ٱللهِ وَكَفَىٰ بِٱللَّهِ وَكِيلًا " `,
    ` " رَبَّنا ولا تُحَمِّلْنا ما لا طاقَةَ لَنا بِهِ " `,
    ` " إِنَّ اللهَ مَعَ الصَّابِرِينَ " `,
    ` " إِنَّ اللهَ لَطِيفٌ خَبِيرٌ " `,
    ` " وَلَا تَيْأَسُوا مِنْ رَوْحِ اللهِ " `,
    ` " لَا يُكَلِّفُ اللهُ نَفْسًا إِلَّا وُسْعَهَا " `,
    ` الحمد لله على كل يوم يأتي ونحن بكامل عافيتنا `,
    ` " إِنَّ مَعِيَ رَبِّي سَيَهْدِينِ " `,
    ` " أَلَيْسَ ٱللهُ بِكَافٍ عَبْدَهُ " `,
    ` " قَدْ جَعَلَها رَبِّي حَقًّا " `,
    ` " وَاصْبِرْ لِحُكْمِ رَبِّكَ فَإِنَّكَ بِأَعْيُنِنَا " `,
    ` " اللهُ لَطيفٌ بِعِبادِهِ " `,
    ` اللهم قوني بك حين يقل صبري `,
    ` " وَأَنَّ سَعْيَهُ سَوْفَ يُرَى " `,
    ` ويراك ترضى وتصبر فيرضيك بما تتمنى `,
    ` " وَمَنْ يَتَّقِ اللهَ يَجْعَلْ لَهُ مَخْرَجًا " `,
    ` اللهم إني أسألك توفيقاً في طريقي <br> وراحة في نفسي وتَيسِيراً في أمري `
]

let okButton = document.querySelector(".ok-button")
let message = document.querySelector(".message")
let i = 0

okButton.addEventListener("click", () => {
    if (i != messageArray.length) {
        message.innerHTML = messageArray[i++]
        if (i == messageArray.length) {
            i = 0
        }
    }
})